app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "text", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "111111"], ["text", "11"], ["created_at", "2020-04-26 23:08:02.482520"], ["updated_at", "2020-04-26 23:08:02.482520"], ["user_id", 1]]
---
    def create
        @article = Article.new(article_params)
        @article.user_id=current_user.id

        if @article.save