app/controllers/comments_controller.rb

    def create
      @comment.user_id=current_user.id
        @article = Article.find(params[:article_id])
        @comment = @article.comments.create(comment_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "first commit to first artical"], ["body", "commit"], ["article_id", 1], ["created_at", "2020-04-26 18:06:59.120268"], ["updated_at", "2020-04-26 18:06:59.120268"]]